[
	{
	  "oasis": "Full-Stack Product Development – Independently designed and delivered end-to-end features for an AI-powered project ideation platform, from concept to production, using Next.js, Python, and LLMs.\n\nAI-Powered Data Processing – Built scalable engines (web scrapers, crawlers, and Chrome extensions) leveraging LLMs to transform raw internet data into structured, ranked project ideas using multidimensional evaluation metrics.\n\nSearch & Automation Systems – Developed semantic search (RAG + vector embeddings), Twitter automation (LLM-generated threads), and blog/video content tools to drive SEO growth and organic traffic at scale.\n\nInfrastructure & Scalability – Engineered CI/CD pipelines (GitHub Actions, AWS), managed monorepo architecture, and implemented monitoring (Helicone, PostHog, Sentry) for high-performance, maintainable systems.\n\nPerformance Optimization – Enhanced platform discoverability via SEO (Google Search Console, SEMRush) and optimized UI/algorithmic ranking for thousands of ideas based on engagement and impact metrics.",
	  
	  "hootboard": "AI-Powered Selfie Kiosk System – Built a Redis-based queue for processing user selfies and automated email delivery, while developing a dynamic mask/frame generator using TensorFlow and JavaScript for real-time face detection.\n\nOffline Optimization & Analytics – Implemented offline functionality for kiosks, increasing feature adoption by 30%, and leveraged Mixpanel for behavior analysis and customer support insights.\n\nDigital Signage & UI Modernization – Designed multi-zone layouts for digital signage (improving content display) and migrated projects from Create React App to Vite, boosting build performance and developer experience.\n\nCross-Platform Integrations – Integrated Shadcn UI components across web and mobile (CityGuide app) and implemented third-party solutions, collaborating directly with clients for tailored outcomes.\n\nPerformance & Release Management – Monitored kiosk uptime/performance at scale using remote tools and managed production releases, ensuring stability and rapid iteration cycles.",
	  
	  "versai": "At Versai, I contributed to the development of the frontend UI for a product that enables users to enjoy concerts directly from their mobile phones.\nUtilizing a tech stack that included ReactJS, TypeScript, PostgreSQL, and Strapi,\nI focused on creating an engaging and user-friendly experience,\nensuring seamless access to live music events through the application.",
	  
	  "y": "I independently developed a comprehensive website for a construction company using pure JavaScript, HTML, and CSS,\ndelivering a solution that precisely aligned with the client's specifications.\nAdditionally, I enhanced several other projects by updating and refining their user interfaces with ReactJS and TypeScript,\nsignificantly improving usability and overall functionality."
	}
  ]